In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [2]:
# reading the file
df1=pd.read_csv("Bengaluru_House_Data.csv ")
print(df1)

                  area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size  society total_sqft  bath  balcony   price
0          2 BHK  Coomee        1056   2.0      1.0   39.07
1      4 Bedroom  Theanmp       2600   5.0      3.0  120.00
2          3 BHK      NaN       1440   2.0      3.0   62.00
3          3 BHK  Soiewre       1521   3.0      1.0   95.00
4          2 BHK      NaN       1200   2.0      1.0   51.00
...          ...      ...        ...   ...      ...     ...
13315  5 Bedroom  ArsiaEx       3453   4.0      0.0  231.00
13316      4 BHK      NaN       3600   5.0      NaN  400.00
13317      2 BHK  Mahla T       1141   2.0      1.0   60.00
13318      4 BHK  SollyCl       4689   4.0      1.0  488.00
13319      1 BHK      NaN        550   1.0      1.0   17.00

[13320 rows x 9 columns]

In [3]:
df1.shape

(13320, 9)

# to drop columns which are irrelavant

In [4]:
#ist cleaning dropint of columns
# now we want to drop some of the column which are not significantcommand used  df1.drop([column_name],[column name])
# after that we will create a new dataframe to store data
df2=df1.drop(['area_type','availability','society','balcony'],axis=1)# by default axis=0
#df2 = df1.drop(['area_type','society','balcony','availability'],axis='columns')
print(df2)

                       location       size total_sqft  bath   price
0      Electronic City Phase II      2 BHK       1056   2.0   39.07
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2                   Uttarahalli      3 BHK       1440   2.0   62.00
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                      Kothanur      2 BHK       1200   2.0   51.00
...                         ...        ...        ...   ...     ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00
13316             Richards Town      4 BHK       3600   5.0  400.00
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00
13319              Doddathoguru      1 BHK        550   1.0   17.00

[13320 rows x 5 columns]

# to drop rows which contain null values

In [5]:
# 2nd cleaning drop null values lets first see how many null values are their
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [6]:
#function used will be dropna()
df3=df2.dropna()
print(df3)

                       location       size total_sqft  bath   price
0      Electronic City Phase II      2 BHK       1056   2.0   39.07
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2                   Uttarahalli      3 BHK       1440   2.0   62.00
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                      Kothanur      2 BHK       1200   2.0   51.00
...                         ...        ...        ...   ...     ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00
13316             Richards Town      4 BHK       3600   5.0  400.00
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00
13319              Doddathoguru      1 BHK        550   1.0   17.00

[13246 rows x 5 columns]

# feature enginearing
# to fetch new columns with number of bedrooms only in it from column size

In [7]:
#lets work on other column i.e size we can see 2 bhk , 4bedroom so diff refrences are used for same thing we have to collect 
#values which are interger in front of everyone i.e from 2 bhk collect 2 so on
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [8]:
# collecting interger values from them to do that we will use split function we split in 2 part 2 nad bhk i.e create list for each elemnet
# collect interger into new column
df3['bhk value']=df3['size'].apply(lambda x: int(x.split(' ')[0])) # split each elemnt into list 2 part and extract the first elemnet

print(df3)

                       location       size total_sqft  bath   price  bhk value
0      Electronic City Phase II      2 BHK       1056   2.0   39.07          2
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00          4
2                   Uttarahalli      3 BHK       1440   2.0   62.00          3
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00          3
4                      Kothanur      2 BHK       1200   2.0   51.00          2
...                         ...        ...        ...   ...     ...        ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00          5
13316             Richards Town      4 BHK       3600   5.0  400.00          4
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00          2
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00          4
13319              Doddathoguru      1 BHK        550   1.0   17.00          1

[13246 rows x 6 columns]

C:\Users\sansa\AppData\Local\Temp\ipykernel_32408\2884081315.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk value']=df3['size'].apply(lambda x: int(x.split(' ')[0])) # split each elemnt into list 2 part and extract the first elemnet

In [9]:

# unique fuction very import to know unique value in column and then analysing them whether they are uselful or not
# so 27 and 43 look odd value here it will return a list
df3['bhk value'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [10]:
df3[df3['bhk value']>20]
# we can see that 27 bhk and 43 bhk has 2400 total sqft its not possible we will see it later what to do with it is it possible or not

                       location        size total_sqft  bath  price  bhk value
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0         27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0         43

# to work on sqft column and eliminating rows with diff unit then sqft and putting mean on place '2100-2150'type rows 
# and converting to float of ramnaing rows value of sqft column

In [11]:
#now lets work on sqft  column and get some insight of it and what to clean in thiis column
df3['total_sqft'].head(10)

0    1056
1    2600
2    1440
3    1521
4    1200
5    1170
6    2732
7    3300
8    1310
9    1020
Name: total_sqft, dtype: object

In [12]:
# we can clearly see value like '1133-1384' so we have to puta single value here look like range is give
# we want to plot columns for value which are not single value i.e 1056,2600 so not single value 
# to fetch these rows you will definea function bool function which will filteer the rows with '1133-1384'

def is_float(x): # x is row elent of tatal_sqft column
    try:
        float(x)
    except:
        return False
    
    return True  # you can convert x into float retrn true else return false

In [13]:
# it will only show those rows which has '2100-2150'type values . we will not create new dataframe here
df3[~df3['total_sqft'].apply(is_float)].head(20)
#1. you can see some of the data has diff unit then sqft i.e yard, acre sq.mt all diff data need to change in sqft but we will
#delete the rows which has diff unit . bcz its hard to deal with them
#2. we will replce '211-2850' with the mean value of both

,location,size,total_sqft,bath,price,bhk value
30,Yelahanka,4 BHK,2100 - 2850,4.0,186.000,4
122,Hebbal,4 BHK,3067 - 8156,4.0,477.000,4
137,8th Phase JP Nagar,2 BHK,1042 - 1105,2.0,54.005,2
165,Sarjapur,2 BHK,1145 - 1340,2.0,43.490,2
188,KR Puram,2 BHK,1015 - 1540,2.0,56.800,2
410,Kengeri,1 BHK,34.46Sq. Meter,1.0,18.500,1
549,Hennur Road,2 BHK,1195 - 1440,2.0,63.770,2
648,Arekere,9 Bedroom,4125Perch,9.0,265.000,9
661,Yelahanka,2 BHK,1120 - 1145,2.0,48.130,2
672,Bettahalsoor,4 Bedroom,3090 - 5002,4.0,445.000,4
772,Banashankari Stage VI,2 BHK,1160 - 1195,2.0,59.935,2
775,Basavanagara,1 BHK,1000Sq. Meter,2.0,93.000,1
850,Bannerghatta Road,2 BHK,1115 - 1130,2.0,58.935,2
872,Singapura Village,2 BHK,1100Sq. Yards,2.0,45.000,2
886,Chandapura,1 BHK,520 - 645,1.0,15.135,1
927,Thanisandra,2 BHK,1000 - 1285,2.0,43.415,2
959,Kammasandra,1 BHK,650 - 665,1.0,18.410,1
990,Sarjapur,1 BHK,633 - 666,1.0,17.535,1
1019,Marathi Layout,1 Bedroom,5.31Acres,1.0,110.000,1
1086,Narasapura,2 Bedroom,30Acres,2.0,29.500,2

In [14]:
# creating new data frame df4 and in df3 we will replace mean with '2100-2150'value
# creating a fuction to replace the values and single value convert to float and diff unit values to drop
# we apply this function to df3 data to get new dataframe df4

    
def convert_sqft_to_num(x):
    # we split it now and create a list 
    tokens=x.split('-')
    if len(tokens)==2: # for '2100-2150 'type value
        return (float(tokens[0])+float(tokens[1]))/2
    try:                                             # try is not bool function
        return float(x)                              # it will turn all single value to float
    except: 
        return None # for diff unit value i.e acre , yard

In [15]:
#df3['total_sqft']=df3['total_sqft'].apply(convert_sqft_to_num)
#df3['total_sqft'] = df3['total_sqft'].apply(convert_sqft_to_num)

#df3.total_sqft = df3.total_sqft.apply(convert_sqft_to_num)
df4 = df3.copy()
df4.total_sqft = df4.total_sqft.apply(convert_sqft_to_num)
df4 = df4[df4.total_sqft.notnull()]
df4.head(2)

                   location       size  total_sqft  bath   price  bhk value
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07          2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00          4

# FEATURE ENGGINEARING IN DATAFRAME.

IF ROWS ARE OF TEXT VALUE WE HAVE TO CONVERT  THAT COLUMN TO OTHER INDIVIDUAL COLUMN.I.E UNIWUE NO. OF ROWS IN LOCATION COLUMN ARE 
1304 THAN WE HAVE TO MAKE NEW 1304 COLUMNS . ALSO CALLED CURSE OF DIMENTIONALITY .
WE CAN REMOVE THAT CURSE BY MANY WAYS.
1.CONVERT MOST IRREVALANT LOCATION COLUMN VALUE INTO OTHER COLUMN NAME VALUE
2.

In [16]:
# lets check how many irrevalent rows in location column .location which are less than 10 are considered irrevalent for this dataframe
df5=df4.copy()
df5['price_per_sqft']=(df5['price']*100000)/(df5['total_sqft']) # price in rupee not lakh of per sqft
df5

,location,size,total_sqft,bath,price,bhk value,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
...,...,...,...,...,...,...,...
13315,Whitefield,5 Bedroom,3453.0,4.0,231.00,5,6689.834926
13316,Richards Town,4 BHK,3600.0,5.0,400.00,4,11111.111111
13317,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.00,2,5258.545136
13318,Padmanabhanagar,4 BHK,4689.0,4.0,488.00,4,10407.336319
13319,Doddathoguru,1 BHK,550.0,1.0,17.00,1,3090.909091

In [17]:
len(df5['location'].unique())   # 1298 unique rows in location column so we will make new 1298 columns in dataframe for analysis

1298

In [18]:
# lets count all type of unique locations in location column . and if any laction is <=10 than convert to other named column
df5['location ']=df5['location'].apply(lambda x: x.strip()) # it will strip away all spaces present in front and end of location value
# after strip fuction now location column is ready to us

In [20]:
#lets count
location_stats = df5['location'].value_counts(ascending=False)   # we use value_count for text count and location stats will no need to group it will directly count
 # we use value_count for text count and location stats will 
location_stats

Whitefield                   532
Sarjapur  Road               392
Electronic City              302
Kanakpura Road               264
Thanisandra                  232
                            ...
Indiranagar HAL 2nd Stage      1
Maruthi HBCS Layout            1
K R C kothanur                 1
1Channasandra                  1
Abshot Layout                  1
Name: location, Length: 1298, dtype: int64

In [1]:
import scipy as sp
a=sp.array((1,2,3))
b=sp.array((2,3,4))
print(sp.column_stack(([a],[b])))
print(sp.column_stack((a,b)))

[[1 2 3 2 3 4]]
[[1 2]
 [2 3]
 [3 4]]

C:\Users\sansa\AppData\Local\Temp\ipykernel_4344\1083452140.py:2: DeprecationWarning: scipy.array is deprecated and will be removed in SciPy 2.0.0, use numpy.array instead
  a=sp.array((1,2,3))
C:\Users\sansa\AppData\Local\Temp\ipykernel_4344\1083452140.py:3: DeprecationWarning: scipy.array is deprecated and will be removed in SciPy 2.0.0, use numpy.array instead
  b=sp.array((2,3,4))
C:\Users\sansa\AppData\Local\Temp\ipykernel_4344\1083452140.py:4: DeprecationWarning: scipy.column_stack is deprecated and will be removed in SciPy 2.0.0, use numpy.column_stack instead
  print(sp.column_stack(([a],[b])))
C:\Users\sansa\AppData\Local\Temp\ipykernel_4344\1083452140.py:5: DeprecationWarning: scipy.column_stack is deprecated and will be removed in SciPy 2.0.0, use numpy.column_stack instead
  print(sp.column_stack((a,b)))